#+title: Literate K3s Cluster
#+author: EnigmaCurry
#+OPTIONS: ^:{}
#+EXPORT_FILE_NAME: index.html
#+EXCLUDE_TAGS: noexport
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="css/build/solarized-dark.css" />
#+HTML_HEAD: <link rel="stylesheet" href="https://cdnjs.cloudflare.com/ajax/libs/github-fork-ribbon-css/0.2.3/gh-fork-ribbon.min.css" />
#+INFOJS_OPT: view:showall toc:t ltoc:above mouse:underline buttons:0 path:css/build/all.min.js

#+BEGIN_EXPORT html
<a class="github-fork-ribbon" href="https://github.com/EnigmaCurry/literate-k3s" data-ribbon="Fork me on GitHub" title="Fork me on GitHub">Fork me on GitHub</a> 
#+END_EXPORT


*** Mirror repositories to GitHub or elsewhere
You can mirror your gitea repositories to another git host, like GitHub. This
has to be setup separately for each repository you wish to mirror.

Create a new SSH keypair (separate from your user account!) to use as a deploy
key:
#+begin_src shell :noweb yes :eval never-export :exports code :results output
SSH_KEY_TMP=$(mktemp -u --suffix .key)
ssh-keygen -C gitea-mirror-$RANDOM -P '' -f ${SSH_KEY_TMP} 2>&1 > /dev/null
echo "Public SSH Key written to ${SSH_KEY_TMP}.pub"
echo "Private SSH Key written to ${SSH_KEY_TMP}"
#+end_src

#+RESULTS:
: Public SSH Key written to /tmp/tmp.gYZkhiUqqD.key.pub
: Private SSH Key written to /tmp/tmp.gYZkhiUqqD.key

Create a new repository on GitHub. Go to the Settings, then Deploy keys and
create a new deploy key, and paste the public key from the file generated
(=/tmp/tmp.#####.key.pub=).

Next you need to create a git hook that pushes to github whenever a gitea
repository receives a push. Go to the gitea repository settings, go to Git
Hooks, edit the hook called post-receive and enter this script:

#+begin_example
#!/bin/bash
## Set the full git SSH URL for the mirror repository:
MIRROR_REPO="git@github.com:GITHUB_USERNAME/GITHUB_REPO_NAME.git"
KNOWNHOSTS=$(mktemp)

## Public known ssh key for github:
cat <<'EOF' > ${KNOWNHOSTS}
github.com ssh-rsa AAAAB3NzaC1yc2EAAAABIwAAAQEAq2A7hRGmdnm9tUDbO9IDSwBK6TbQa+PXYPCPy6rbTrTtw7PHkccKrpp0yVhp5HdEIcKr6pLlVDBfOLX9QUsyCOV0wzfjIJNlGEYsdlLJizHhbn2mUjvSAHQqZETYP81eFzLQNnPHt4EVVUh7VfDESU84KezmD5QlWpXLmvU31/yMf+Se8xhHTvKSCZIFImWwoG6mbUoWf9nzpIoaSjB+weqqUUmpaaasXVal72J+UX2B+2RPW3RcT0eOzQgqlJL3RKrTJvdsjE3JEAvGq3lGHSZXy28G3skua2SmVi/w4yCE6gbODqnTWlg7+wC604ydGXA8VJiS5ap43JXiUFFAaQ==
EOF

## Private ssh deploy key for remote mirror:
KEYFILE=$(mktemp)
cat <<'EOF' > ${KEYFILE}
-----BEGIN OPENSSH PRIVATE KEY-----
  YOUR DEPLOY KEY GOES HERE
-----END OPENSSH PRIVATE KEY-----
EOF

## Push changes to mirror using deploy key and known hosts file:
GIT_SSH_COMMAND="/usr/bin/ssh -i ${KEYFILE} -o UserKnownHostsFile=${KNOWNHOSTS}" git push --mirror ${MIRROR_REPO}
rm ${KNOWNHOSTS}
rm ${KEYFILE}
#+end_example

Edit the =MIRROR_REPO= at the top for your repository. Replace the placeholder
for the deployment key, with the one generated in the private key file
(=/tmp/tmp.#####.key=). Save the hook.

Now when you push to this repository it should automatically push to the remote
mirror as well.
